{
  "Love": {
    "Words of Affirmation": "Actions don’t always speak louder than words. Unsolicited compliments may mean the world to [NAME]. Just as hearing the words, “I love you,” and the reasons behind that love may send [NAME]’s spirits skyward, insults can leave this person shattered and are not easily forgotten.",
    "Acts of Service": "“Let me do that for you” may be one of the most special things that [NAME] can hear.  Anything you do to lighten [NAME]’s responsibilities may speak volumes to them.  Similarly, when someone is lazy, breaks their commits, or makes more work for [NAME], it may tell [NAME] that their feelings don’t matter.",
    "Receiving Gifts": "Don’t mistake this love language for materialism; when [NAME] receives a gift, they may thrive on the love, thoughtfulness, and effort behind the gift.  Just as the perfect gift or gesture may show [NAME] that they are known, cared for, and valued, they feel especially hurt when someone misses their birthday, anniversary, or gives them a hasty, thoughtless gift.",
    "Quality Time": "Few things may mean more to [NAME] than having your full, undivided attention. Being there for them is critical, but really being there - with the TV off, fork and knife down, and all chores and tasks on standby - really may make [NAME] feel truly special and loved.  Similarly, distractions, postponed dates, or the failure to listen can be especially hurtful.",
    "Physical Touch": "Things like hugs, pats on the back, holding hands, and thoughtful touches on the arm, shoulder, or face may be very special to [NAME].  These actions can all be ways to show excitement, concern, care, and love. Physical presence and accessibility may be crucial for [NAME], while neglect or abuse can be unforgivable and destructive."
  },
  "Anger": {
    "Reactive": "[NAME] may respond immediately to a supposed insult or injustice. They may yell, throw things, or slam doors.  [NAME] tends to act this way because it gets immediate results, but later, they may feel ashamed because they didn’t control themselves or they know they hurt the other person.\n\n Despite the obnoxious behavior, loud shouting, screeching voices, clenching fists, pointing fingers, red faces and all, most angry people have a sad message. Most likely they are trying to tell you that they are feeling hurt, ignored, disrespected, unappreciated and unloved.\n\n Listening and responding to these needs calmly and emphatically can serve as the key to getting more cooperation from emotionally reactive people. Just say “I think I understand what is going on here, but feel free to correct me” and so on. Then offer some reflective listening, validating their concerns to an extent. Tell them something nice and peaceful. Agree with them in theory. Do not assign any blame or argue. Establish a basic premise for peace by appealing in some way to the dormant, healthy side of their personality by extending to them some sense of grace, validation, and acceptance.",
    "Passive Aggressive": "[NAME] may indirectly express anger by sabotaging, gossiping, withholding praise, using the \"silent treatment\", or making digs at another person.  Even though [NAME]’s passive-aggressive behavior is easily recognized, confronting it may only lead to more subtle attacks.\n\n Many passive-aggressive individuals behave as they do because they believe they don’t have a voice or are not being listened to. When appropriate, include [NAME] in discussions on challenges and solutions. Solicit their input. Ask, for example, \"Given the desired outcome, how would you handle this issue?\" See if they come up with any constructive solutions. On the other hand, if what you hear are mostly complaints and criticisms, don’t agree or disagree. Simply say that you’ll keep what they said in mind, and get on with what you need to get done.\n\n Since passive-aggressive individuals operate covertly, they will almost always put up resistance when confronted on their behavior. Denial, excuse making, and finger pointing are just a few of the likely retorts. Regardless of what they say, declare what you're willing to do going forward. Importantly, offer one or more strong consequences to compel the passive-aggressive to reconsider his or her behavior.\n\n The ability to identify and assert consequence is one of the most powerful skills we can use to \"stand down\" a passive-aggressive person. Effectively articulated, consequence gives pause to the difficult individual, and compels her or him to shift from obstruction to cooperation.",
    "Avoidant": "When [NAME] is angry, they may often pretend that nothing is wrong, even when something certainly is.  [NAME] may withdraw from relationships and other people as a defensive measure to reduce the risk of rejection, accountability, criticism or exposure.\n\n To help overcome avoidant behavior, the person needs to feel as safe as possible with you.  Since any hint of criticism, ridicule, or rejection can trigger his withdrawal, it is crucial to accept them just as they are.  Ask sincere questions that show you are interested in their life and disclose things about youself, including your own struggles and weaknesses, to develop a sense of togetherness, safety, and encourage reciprocal sharing.  Take things slowly though.  If either you or the avoidant person discloses too much too quickly, things can backfire.\n\n Once you reach a level of honest mutual sharing, you may need to lovingly confront one of the avoidant person's behaviors.  Empathize with the person's pain and reasons for acting or seeing things the way he or she does, then kindly point out the problems these reactions are causing. Continue to show that you still accept them even if they doesn't change. You aren't being critical or condemning.  You are simply trying to help them observe that something they do actually interferes with what they really want in life.",
    "Direct": "When [NAME] is angry, they may construct a rational, effective, and respectful approach before speaking about it.  [NAME] may not find it difficult to admit when they are angry, and when they are, they want to move past the challenge by having a clear and direct discussion about it.\n\n A person who is assertive believes that they have a responsibility to protect their own rights.  They will generally respect other people’s rights as well but not necessarily their behavior.  They want you to feel valued, trusted, and respected and they expect to be valued, trusted, and respected in return.  They expect their perspective to be listened to and thoughtfully considered and they look forward to negotiating a solution.\n\n Once a solution is reached, the an assertive person often expects both people to abide by the solution and keep all conversations and discussions above board.  If an issue were to come up again, if you address it with them directly, they feel trusted and respected and will further trust and respect you."
  }
}